client/result/jetty/result-jetty-500-2.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   0.104 seconds
Complete requests:      500
Failed requests:        95
   (Connect: 0, Receive: 50, Length: 45, Exceptions: 0)
Write errors:           111
Total transferred:      114042 bytes
HTML transferred:       38930 bytes
Requests per second:    4829.56 [#/sec] (mean)
Time per request:       26.503 [ms] (mean)
Time per request:       0.207 [ms] (mean, across all concurrent requests)
Transfer rate:          1075.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   19   6.5     21      29
Processing:     0    3   6.6      0      26
Waiting:        0    3   6.0      0      23
Total:          8   22   4.0     22      30

Percentage of the requests served within a certain time (ms)
  50%     22
  66%     23
  75%     24
  80%     24
  90%     27
  95%     27
  98%     30
  99%     30
 100%     30 (longest request)