client/result/jetty/result-jetty-500-4.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.5.160 (be patient)
Send request failed!
Send request failed!
Send request failed!
[...]


Server Software:        Jetty(8.1.2.v20120308)
Server Hostname:        192.168.5.160
Server Port:            8080

Document Path:          /sample/index.html
Document Length:        85 bytes

Concurrency Level:      128
Time taken for tests:   0.059 seconds
Complete requests:      500
Failed requests:        111
   (Connect: 0, Receive: 88, Length: 23, Exceptions: 0)
Write errors:           126
Total transferred:      118524 bytes
HTML transferred:       40460 bytes
Requests per second:    8488.53 [#/sec] (mean)
Time per request:       15.079 [ms] (mean)
Time per request:       0.118 [ms] (mean, across all concurrent requests)
Transfer rate:          1965.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        2   11   3.1     12      19
Processing:     0    2   3.2      1      15
Waiting:        0    2   2.7      1      13
Total:          3   13   2.7     13      24

Percentage of the requests served within a certain time (ms)
  50%     13
  66%     14
  75%     15
  80%     15
  90%     17
  95%     19
  98%     20
  99%     21
 100%     24 (longest request)